Revit 2024 API
Toposolid.Split Method
 Split the toposolid by the given curve loops.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public IList<ElementId> Split(
	IList<CurveLoop> splitCurveLoops
)
Visual Basic
Public Function Split ( _
	splitCurveLoops As IList(Of CurveLoop) _
) As IList(Of ElementId)
Visual C++
public:
IList<ElementId^>^ Split(
	IList<CurveLoop^>^ splitCurveLoops
)
Parameters
splitCurveLoops
Type: System.Collections.Generic.IList<CurveLoop>
 An array of planar curve loops that are used to split the toposolid. All of the curve loops should lie on the sketch plane of the toposolid.
Return Value
 An array of newly created toposolid ids after split.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The split curve loops should all lie on the sketch plane of the toposolid.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
Toposolid Class
Autodesk.Revit.DB Namespace